from django.shortcuts import render
from django.http import HttpResponse

"""
----------------------------------------------------------------------
フレンド／フォロー一覧
----------------------------------------------------------------------
"""
def follow(request):
    return HttpResponse("follow page")

"""
----------------------------------------------------------------------
フレンド／フォロー解除処理
----------------------------------------------------------------------
"""
def release(request):
    return HttpResponse("release page")

"""
----------------------------------------------------------------------
フレンド／フォロワー一覧
----------------------------------------------------------------------
"""
def follower(request):
    return HttpResponse("follower page")

"""
----------------------------------------------------------------------
フレンド／フォロー許可ページ
----------------------------------------------------------------------
"""
def permit(request):
    return HttpResponse("permit page")

"""
----------------------------------------------------------------------
フレンド／フォロー許可処理
----------------------------------------------------------------------
"""
def run_permit(request):
    return HttpResponse("run_permit page")

"""
----------------------------------------------------------------------
フレンド／フォロー不許可処理
----------------------------------------------------------------------
"""
def run_nopermit(request):
    return HttpResponse("run_nopermit page")



