from django.shortcuts import render
from django.http import HttpResponse

"""
----------------------------------------------------------------------
プレイグランド／プレイグランド
----------------------------------------------------------------------
"""
def index(request):
    return HttpResponse("playground")

"""
----------------------------------------------------------------------
プレイグランド／実行処理
----------------------------------------------------------------------
"""
def run(request):
    return HttpResponse("run code")

"""
----------------------------------------------------------------------
プレイグランド／コード編集
----------------------------------------------------------------------
"""
def index_edit(request, code_id):
    return HttpResponse("playground code_id:" + str(code_id))

"""
----------------------------------------------------------------------
プレイグランド／実行処理
----------------------------------------------------------------------
"""
def run_code(request, code_id):
    return HttpResponse("run code_id:" + str(code_id))

"""
----------------------------------------------------------------------
プレイグランド／問題ページ
----------------------------------------------------------------------
"""
def question(request, question_id):
    return HttpResponse("question:" + str(question_id) + " playground")

"""
----------------------------------------------------------------------
プレイグランド／問題処理
----------------------------------------------------------------------
"""
def run_question(request, question_id):
    return HttpResponse("run_question" + str(question_id))

"""
----------------------------------------------------------------------
プレイグランド／保存処理
----------------------------------------------------------------------
"""
def save(request, code_id):
    return HttpResponse("save code_id:" + str(code_id))
