from django.shortcuts import render
from django.http import HttpResponse

"""
----------------------------------------------------------------------
プレイグランド／入力ページ
----------------------------------------------------------------------
"""
def index(request):
    return HttpResponse("playground page")

"""
----------------------------------------------------------------------
プレイグランド／実行処理
----------------------------------------------------------------------
"""
def run(request):
    return HttpResponse("run page")

"""
----------------------------------------------------------------------
プレイグランド／問題ページ
----------------------------------------------------------------------
"""
def question(request):
    return HttpResponse("playground question page")

"""
----------------------------------------------------------------------
プレイグランド／問題処理
----------------------------------------------------------------------
"""
def run_question(request):
    return HttpResponse("run_question page")

"""
----------------------------------------------------------------------
プレイグランド／保存処理
----------------------------------------------------------------------
"""
def save(request):
    return HttpResponse("save page")
