from pyground.tests import CommonTestCase
from django.urls    import reverse


# モデル
from bookmark.models   import Bookmark
from friend.models     import Follow, Permit
from playground.models import Code
from question.models   import Question, Correcter
from user.models       import User, Profile

# templateのあるviewのみテスト

class QuestionsViewTest(CommonTestCase):
    """
    ----------------------------------------------------------------------
    問題／一覧ページ
    ----------------------------------------------------------------------
    """
    def test_questions(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        - 質問一覧を表示できるか
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------
        u = self.make_user('u1', 'a@b.jp', '0000')
        q1 = self.make_question(1, u.id)
        q2 = self.make_question(2, u.id)

        lu = self.make_login_user(u.id, u.username)

        # 実行 -----------------------------------------------------
        url = reverse('question:questions')
        response = self.client.get(url)
        # テスト ---------------------------------------------------
        res_q1 = "<Question: 1>"
        res_q2 = "<Question: 2>"
        # レスポンス
        self.assertEqual(response.status_code, 200)
        # レスポンス(配列・構造体)
        self.assertQuerysetEqual(
            response.context['question_list'],
            [res_q1, res_q2],
            ordered=False,
        )

    def test_redirect(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        - ユーザーがログインしてない状態でのリダイレクト
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------

        # 実行 -----------------------------------------------------
        response = self.client.get(reverse('question:questions'))

        # テスト ---------------------------------------------------
        self.assertRedirects(
            response,
            expected_url=reverse('top:top'),
            status_code=302,
            target_status_code=200,
        )

class ManageViewTest(CommonTestCase):
    """
    ----------------------------------------------------------------------
    問題／管理ページ
    ----------------------------------------------------------------------
    """
    def test_manage(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        該当の問題を表示できるか
        ** 入力値 **
        
        ** 期待値 **
        
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------
        u = self.make_user('u1', 'a@b.jp', '0000')
        u_other = self.make_user('u2', 'a@b.jp', '0000')
        q1 = self.make_question(1, u.id)
        q2 = self.make_question(2, u.id)
        q3 = self.make_question(3, u_other.id)


        lu = self.make_login_user(u.id, u.username)

        # 実行 -----------------------------------------------------
        url = reverse('question:manage', args=(u.id, ))
        response = self.client.get(url)

        # テスト ---------------------------------------------------
        res_q1 = "<Question: 1>"
        res_q2 = "<Question: 2>"
        # レスポンス
        self.assertEqual(response.status_code, 200)
        # レスポンス(配列・構造体)
        self.assertQuerysetEqual(
            response.context['question_list'],
            [res_q1, res_q2],
            ordered=False,
        )

    def test_redirect(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        - ユーザーがログインしてない状態でのリダイレクト
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------
        u = self.make_user('u1', 'a@n.jp', '0000')

        # 実行 -----------------------------------------------------
        response = self.client.get(reverse('question:manage', args=(u.id, )))

        # テスト ---------------------------------------------------
        self.assertRedirects(
            response,
            expected_url=reverse('top:top'),
            status_code=302,
            target_status_code=200,
        )

class DetailViewTest(CommonTestCase):
    """
    ----------------------------------------------------------------------
    問題／詳細ページ
    ----------------------------------------------------------------------
    """
    def test_detail(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        - 該当の問題の詳細と周辺情報が表示できるか
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------
        u1 = self.make_user('u1', 'a@b.jp', '0000')
        u2 = self.make_user('u2', 'b@b.jp', '0000')
        u3 = self.make_user('u3', 'c@b.jp', '0000')
        u4 = self.make_user('u4', 'd@b.jp', '0000')

        q = self.make_question(1, u4.id)
        c1 = self.make_collecter(u2.id, q.id)
        c2 = self.make_collecter(u3.id, q.id)

        b = self.make_bookmark(u1.id, q.id)

        lu = self.make_login_user(u1.id, u1.username)

        # 実行 -----------------------------------------------------
        url = reverse('question:detail', args=(u1.id, ))
        response = self.client.get(url)

        # テスト ---------------------------------------------------
        res_c2 = '<User: u2>'
        res_c3 = '<User: u3>'
        # レスポンス
        self.assertEqual(response.status_code, 200)
        self.assertEqual(response.context['question'], q)
        self.assertEqual(response.context['is_bookmark'], True)
        # レスポンス(配列・構造体)
        self.assertQuerysetEqual(
            response.context['correct_users'],
            [res_c2, res_c3],
            ordered=False,
        )

    def test_redirect(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        - ユーザーがログインしてない状態でのリダイレクト
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------
        u = self.make_user('u1', 'a@n.jp', '0000')
        q = self.make_question(1, u.id)

        # 実行 -----------------------------------------------------
        response = self.client.get(reverse('question:detail', args=(q.id, )))

        # テスト ---------------------------------------------------
        self.assertRedirects(
            response,
            expected_url=reverse('top:top'),
            status_code=302,
            target_status_code=200,
        )

class CreateViewTest(CommonTestCase):
    """
    ----------------------------------------------------------------------
    問題／新規作成ページ
    ----------------------------------------------------------------------
    """
    def test_redirect(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        - ユーザーがログインしてない状態でのリダイレクト
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------

        # 実行 -----------------------------------------------------
        response = self.client.get(reverse('question:create'))

        # テスト ---------------------------------------------------
        self.assertRedirects(
            response,
            expected_url=reverse('top:top'),
            status_code=302,
            target_status_code=200,
        )

# ここから未実装
class RunCreateViewTest(CommonTestCase):
    """
    ----------------------------------------------------------------------
    問題／新規作成処理
    ----------------------------------------------------------------------
    """
    def test_run_create(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        問題の作成ができるか
        ** 入力値 **
        
        ** 期待値 **
        
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------
        u1 = self.make_user('u1', 'a@b.jp', '0000')

        lu = self.make_login_user(u1.id, u1.username)

        post_data = {
            'name'           : 'q1',
            'question_text'  : 'aaaa',
            'question_input' : 'aaaa',
            'question_output': 'aaaa',
            'default_code'   : 'aaaa',
            'target_user_id' : u1.id,
        }
        # 実行 -----------------------------------------------------
        url = reverse('question:run_create')
        response = self.client.post(url, post_data)

        create_q = Question.objects.get(name = post_data['name'])

        # テスト ---------------------------------------------------
        # レスポンス
        self.assertEqual(response.status_code, 200)
        self.assertEqual(create_q.name, post_data['name'])

    def test_validate_name(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        入力内容のバリデーションチェック(name)
        ** 入力値 **
        
        ** 期待値 **
        
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------

        # 実行 -----------------------------------------------------

        # テスト ---------------------------------------------------


    def test_validate_text(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        入力内容のバリデーションチェック(text)
        ** 入力値 **
        
        ** 期待値 **
        
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------

        # 実行 -----------------------------------------------------

        # テスト ---------------------------------------------------


    def test_redirect(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        - ユーザーがログインしてない状態でのリダイレクト
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------

        # 実行 -----------------------------------------------------
        response = self.client.get(reverse('question:run_create'))

        # テスト ---------------------------------------------------
        self.assertRedirects(
            response,
            expected_url=reverse('top:top'),
            status_code=302,
            target_status_code=200,
        )

class EditViewTest(CommonTestCase):
    """
    ----------------------------------------------------------------------
    問題／編集ページ
    ----------------------------------------------------------------------
    """
    def test_edit(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        編集ページに必要な情報を表示できるか
        ** 入力値 **
        
        ** 期待値 **
        
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------

        # 実行 -----------------------------------------------------

        # テスト ---------------------------------------------------

    def test_edit_with_no_question(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        該当する問題情報がない時に適切な処理ができるか
        ** 入力値 **
        
        ** 期待値 **
        
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------

        # 実行 -----------------------------------------------------

        # テスト ---------------------------------------------------


    def test_redirect(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        - ユーザーがログインしてない状態でのリダイレクト
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------
        u = self.make_user('u1', 'a@n.jp', '0000')
        q = self.make_question(1, u.id)


        # 実行 -----------------------------------------------------
        response = self.client.get(reverse('question:edit', args=(q.id, )))

        # テスト ---------------------------------------------------
        self.assertRedirects(
            response,
            expected_url=reverse('top:top'),
            status_code=302,
            target_status_code=200,
        )

class RunEditViewTest(CommonTestCase):
    """
    ----------------------------------------------------------------------
    問題／編集処理
    ----------------------------------------------------------------------
    """
    def test_run_edit(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        問題の編集が登録できるか
        ** 入力値 **
        
        ** 期待値 **
        
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------

        # 実行 -----------------------------------------------------

        # テスト ---------------------------------------------------


    def test_run_edit_with_no_question_id(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        該当のquestion_idがない時に適切な処理ができるか
        ** 入力値 **
        
        ** 期待値 **
        
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------

        # 実行 -----------------------------------------------------

        # テスト ---------------------------------------------------


    def test_validate_name(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        入力情報のバリデーション(name)
        ** 入力値 **
        
        ** 期待値 **
        
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------

        # 実行 -----------------------------------------------------

        # テスト ---------------------------------------------------


    def test_validate_question_text(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        入力情報のバリデーション(text)
        ** 入力値 **
        
        ** 期待値 **
        
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------

        # 実行 -----------------------------------------------------

        # テスト ---------------------------------------------------


    def test_redirect(self):
        """
        ----------------------------------------------------------------
        ** テスト内容 **
        - ユーザーがログインしてない状態でのリダイレクト
        ----------------------------------------------------------------
        """
        # データ作成 ------------------------------------------------
        u = self.make_user('u1', 'a@n.jp', '0000')
        q = self.make_question(1, u.id)

        # 実行 -----------------------------------------------------
        response = self.client.get(reverse('question:run_edit', args=(q.id, )))

        # テスト ---------------------------------------------------
        self.assertRedirects(
            response,
            expected_url=reverse('top:top'),
            status_code=302,
            target_status_code=200,
        )