from django.shortcuts import render
from django.http import HttpResponse

"""
----------------------------------------------------------------------
問題／一覧ページ
----------------------------------------------------------------------
"""
def questions(request):
    return HttpResponse("questions page")

"""
----------------------------------------------------------------------
問題／管理ページ
----------------------------------------------------------------------
"""
def manage(request, user_id):
    return HttpResponse(str(user_id) + "'s question list.")

"""
----------------------------------------------------------------------
問題／詳細ページ
----------------------------------------------------------------------
"""
def detail(request, question_id):
    return HttpResponse(str(question_id) + "'s detail.")

"""
----------------------------------------------------------------------
問題／新規作成ページ
----------------------------------------------------------------------
"""
def create(request):
    return HttpResponse("create question page.")

"""
----------------------------------------------------------------------
問題／新規作成処理
----------------------------------------------------------------------
"""
def run_create(request):
    return HttpResponse("create question")

"""
----------------------------------------------------------------------
問題／編集ページ
----------------------------------------------------------------------
"""
def edit(request, question_id):
    return HttpResponse(str(question_id) + "'s edit page.")

"""
----------------------------------------------------------------------
問題／編集処理
----------------------------------------------------------------------
"""
def run_edit(request, question_id):
    return HttpResponse("edit question_id:" + str(question_id))