from django.shortcuts import render
from django.urls      import reverse
from django.http      import HttpResponse, HttpResponseRedirect

# from top.urls import urlpatterns

"""
----------------------------------------------------------------------
ユーザー／登録ページ
----------------------------------------------------------------------
"""
def register(request):
    return render(request, "user/register.html")

"""
----------------------------------------------------------------------
ユーザー／登録完了ページ
----------------------------------------------------------------------
"""
def register_complete(request):
    return render(request, "user/register_complete.html")

"""
----------------------------------------------------------------------
ユーザー／登録処理
----------------------------------------------------------------------
"""
def run_register(request):

    return HttpResponseRedirect(reverse('user:register_complete'))

"""
----------------------------------------------------------------------
ユーザー／ログインページ
----------------------------------------------------------------------
"""
def login(request):
    return render(request, "user/login.html")

"""
----------------------------------------------------------------------
ユーザー／ログイン処理
----------------------------------------------------------------------
"""
def run_login(request):
    return HttpResponseRedirect(reverse('user:detail', args=(1,)))

"""
----------------------------------------------------------------------
ユーザー／ログアウト処理
----------------------------------------------------------------------
"""
def run_logout(request, user_id):
    return HttpResponseRedirect(reverse('top:top'))

"""
----------------------------------------------------------------------
ユーザー／退会ページ
----------------------------------------------------------------------
"""
def withdrawal(request, user_id):
    return render(request, "user/withdrawal.html", {
        'user_id': user_id,
    })

"""
----------------------------------------------------------------------
ユーザー／退会処理
----------------------------------------------------------------------
"""
def run_withdrawal(request, user_id):
    return HttpResponseRedirect(reverse('top:top'))

"""
----------------------------------------------------------------------
ユーザー／プロフィール詳細ページ
----------------------------------------------------------------------
"""
def detail(request, user_id):
    return render(request, "user/detail.html", {
        'user_id': user_id,
    })

"""
----------------------------------------------------------------------
ユーザー／プロフィール新規作成ページ
----------------------------------------------------------------------
"""
def create(request):
    return render(request, "user/create.html")

"""
----------------------------------------------------------------------
ユーザー／プロフィール新規作成処理
----------------------------------------------------------------------
"""
def run_create(request):
    return HttpResponseRedirect(reverse('user:detail', args=(1,)))

"""
----------------------------------------------------------------------
ユーザー／プロフィール編集ページ
----------------------------------------------------------------------
"""
def edit(request, user_id):
    return render(request, "user/edit.html", {
        'user_id': user_id,
    })

"""
----------------------------------------------------------------------
ユーザー／プロフィール編集処理
----------------------------------------------------------------------
"""
def run_edit(request, user_id):
    return HttpResponseRedirect(reverse('user:detail', args=(user_id,)))

"""
----------------------------------------------------------------------
ユーザー／ユーザー一覧ページ
----------------------------------------------------------------------
"""
def index(request):
    return render(request, "user/index.html")